<html>
<head>
<title>HTML</title>
<style type="text/css">
    body{
        font-family: 'Times New Roman';
        background: silver;
        margin-top: 40px;
        margin-left: 10%;,<!DOCTYPE html>
            margin-right: 10%;
        font-size: 20px;
    }
    </style>
    </head>
    <body>
    <p style="text-align: center"><b style="color: red">Limbajul de Marcare HTML</b></p>
    <p>&emsp;&emsp;<b> HTML </b>(<b>Hypertext M</b>arkup <b>L</b>anguage) este un limbaj de marcare care st&#x0103; la baza dezvolt&#x0103;rii oric&#x0103;rei pagini Web. Limbajul HTML const&#0103; &#x00EE;ntr-o serie de etichete numite &#x0219;i tag-uri care permit formatarea modului de afi&#x0219;are a informa&#x021B;iei din pagina Web (folosire unor anumite font-uri, culori &#x0219;i stiluri pentru text, &#x00EE;nserarea unor imagini sau a unor tabele, utilizarea listelor &#x0219;i a formularelor etc.)
    <br>&emsp;&emsp;Tag-urile HTML sunt incluse &#x00EE;ntre paranteze ascu&#x021B;ite &#060;&#62;majoritatea dintre ele fiind &#x00EE;n pereche, tag-ul de &#x00EE;nceput av&#x00E2;nceput av&#x00E2;nd sintaxa <..> iar tag-ul de sf&#x00E2;r&#x0219;it</..>. Unele dintre tag-urile HTML permit precizarea unor caracteristic ale elementului pe care &#x00E2;l introduc, sub forma<i>caracteristic&#x0103;=valoare</i>, aceste caracteristici fiind numite atribute. O etichet&#x0103; poate avea unul, nici unul, sau mai multe atribute.
    <br>&emsp;&emsp;Con&#x021B;inutul unui document HTML nu este <i>case-sensitive</i>, cu alte cuvinte nu se face diferen&#x021B;a &#x00EE;ntre litere mari &#x0219;i mici la nivelul etichetelor &#x0219;i atributelor, &#x00EE;ns&#x0103; valoarea unui atribut poate fi<i> case-sensitive</i>, cum este cazul loca&#x021B;iilor fi&#x0219;ierelor &#x0219;i adreselor URL.</p>
    <hr>
    <p style="color: blue">
        <br>&emsp;&emsp;Un document HTML este un fi&#x0219;ier care are extensia <i>.htm </i>sau <i>.html</i> Pentru editarea textului unui document HTML pot fi folosite orice tipuri de editoare, &#x00EE;ncep&#x00E2;nd cu editoare simple cum ar fi Notepad,
        <br>&emsp;&emsp;&emsp;&emsp;Textpad &#x0219;i ajung&#x00E2;nd la editoare mai complicate cum ar fi Macromedia Dreamweaver.
    </p>
    <hr>